tiborsimon/embedded-tdd-headers/pic/pic18/pic18f26k20_tdd.h
#define ACKEN                         522
#define ACKDT                         523
#define ACKSTAT                       524
#define GCEN                          525
#define SSPCON1                       526
#define SSPM0                         527
#define SSPM                          528
#define SSPM1                         529
#define SSPM2                         530
#define SSPM3                         531
#define CKP                           532
#define SSPEN                         533
#define SSPOV                         534
#define WCOL                          535
#define SSPSTAT                       536
#define BF                            537
#define UA                            538
#define R_NOT_W                       539
#define NOT_W                         540
#define nW                            541
#define RW                            542
#define nWRITE                        543
#define R                             544
#define W                             545
#define NOT_WRITE                     546
#define R_nW                          547
#define R_W                           548
#define START                         549
#define S                             550
#define STOP                          551
#define P                             552
#define A                             553
#define NOT_A                         554
#define nA                            555
#define D_A                           556
#define D_nA                          557
#define D                             558
#define DA                            559
#define D_NOT_A                       560
#define NOT_ADDRESS                   561
#define nADDRESS                      562
#define CKE                           563
#define SMP                           564
#define T2CON                         565
#define T2CKPS0                       566
#define T2CKPS                        567
#define T2CKPS1                       568
#define TMR2ON                        569
#define T2OUTPS0                      570
#define T2OUTPS                       571
#define T2OUTPS1                      572
#define T2OUTPS2                      573
#define T2OUTPS3                      574
#define PR2                           575
#define WM0                           576
#define WM1                           577
#define WAIT0                         578
#define WAIT1                         579
#define EBDIS                         580
#define T1CON                         581
#define TMR1ON                        582
#define TMR1CS                        583
#define NOT_T1SYNC                    584
#define T1SYNC                        585
#define nT1SYNC                       586
#define T1OSCEN                       587
#define SOSCEN                        588
#define T1CKPS0                       589
#define T1CKPS                        590
#define T1CKPS1                       591
#define T1RUN                         592
#define T1CON_RD16                    593
#define T1RD16                        594
#define RCON                          595
#define BOR                           596
#define NOT_BOR                       597
#define nBOR                          598
#define POR                           599
#define nPOR                          600
#define NOT_POR                       601
#define PD                            602
#define nPD                           603
#define NOT_PD                        604
#define NOT_TO                        605
#define nTO                           606
#define TO                            607
#define nRI                           608
#define NOT_RI                        609
#define RI                            610
#define SBOREN                        611
#define IPEN                          612
#define WDTCON                        613
#define SWDTE                         614
#define SWDTEN                        615
#define HLVDCON                       616
#define HLVDL                         617
#define HLVDL0                        618
#define LVV0                          619
#define LVDL0                         620
#define HLVDL1                        621
#define LVDL1                         622
#define LVV1                          623
#define HLVDL2                        624
#define LVV2                          625
#define LVDL2                         626
#define HLVDL3                        627
#define LVV3                          628
#define LVDL3                         629
#define HLVDEN                        630
#define LVDEN                         631
#define BGST                          632
#define IRVST                         633
#define IVRST                         634
#define VDIRMAG                       635
#define OSCCON                        636
#define SCS0                          637
#define SCS                           638
#define SCS1                          639
#define IOFS                          640
#define OSTS                          641
#define IRCF                          642
#define IRCF0                         643
#define IRCF1                         644
#define IRCF2                         645
#define IDLEN                         646
#define T0CON                         647
#define T0PS                          648
#define T0PS0                         649
#define T0PS1                         650
#define T0PS2                         651
#define PSA                           652
#define T0SE                          653
#define T0CS                          654
#define T08BIT                        655
#define TMR0ON                        656
#define STATUS                        657
#define C                             658
#define CARRY                         659
#define DC                            660
#define ZERO                          661
#define Z                             662
#define OV                            663
#define OVERFLOW                      664
#define N                             665
#define NEGATIVE                      666
#define INTCON3                       667
#define INT1IF                        668
#define INT1F                         669
#define INT2IF                        670
#define INT2F                         671
#define INT1E                         672
#define INT1IE                        673
#define INT2IE                        674
#define INT2E                         675
#define INT1P                         676
#define INT1IP                        677
#define INT2IP                        678
#define INT2P                         679
#define INTCON2                       680
#define RBIP                          681
#define TMR0IP                        682
#define INTEDG2                       683
#define INTEDG1                       684
#define INTEDG0                       685
#define RBPU                          686
#define NOT_RBPU                      687
#define nRBPU                         688
#define INTCON                        689
#define RBIF                          690
#define INT0F                         691
#define INT0IF                        692
#define T0IF                          693
#define TMR0IF                        694
#define RBIE                          695
#define INT0E                         696
#define INT0IE                        697
#define T0IE                          698
#define TMR0IE                        699
#define PEIE                          700
#define PEIE_GIEL                     701
#define GIEL                          702
#define GIE_GIEH                      703
#define GIE                           704
#define GIEH                          705
#define SP0                           706
#define STKPTR                        707
#define SP1                           708
#define SP2                           709
#define SP3                           710
#define SP4                           711
#define STKUNF                        712
#define STKOVF                        713
#define STKFUL                        714

#endif // _PIC18F26K20_H_
